<a href="https://colab.research.google.com/github/Glendah-Nyabuto/week4/blob/main/Monday_Week4_Data_Investigation_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 

import pandas as pd
# Importing the numpy library
#
import numpy as np

## 1.1 Reading the Dataset from our CSV file



The dataset we will use contains information about the 2009 Census - The Rural Urban Population by Age, Sex and District.


*   Dataset link for download or access: [Link](https://drive.google.com/open?id=1pc9ZLFGsosdWBk1lI29ADIqRtCvD_FBe)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
df = pd.read_csv('/content/Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv')
df

           District Urban/Rural Age_years  ...   County  Province  OBJECTID
0      NAIROBI WEST       Urban         0  ...  Nairobi   NAIROBI         0
1      NAIROBI WEST       Urban         1  ...  Nairobi   NAIROBI         1
2      NAIROBI WEST       Urban         2  ...  Nairobi   NAIROBI         2
3      NAIROBI WEST       Urban         3  ...  Nairobi   NAIROBI         3
4      NAIROBI WEST       Urban         4  ...  Nairobi   NAIROBI         4
...             ...         ...       ...  ...      ...       ...       ...
25415    TESO SOUTH       Rural        77  ...    Busia   WESTERN     25415
25416    TESO SOUTH       Rural        78  ...    Busia   WESTERN     25416
25417    TESO SOUTH       Rural        79  ...    Busia   WESTERN     25417
25418    TESO SOUTH       Rural       80+  ...    Busia   WESTERN     25418
25419    TESO SOUTH       Rural    Age NS  ...    Busia   WESTERN     25419

[25420 rows x 9 columns]

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df.head(10)

       District Urban/Rural Age_years   Male  ...  Total   County Province OBJECTID
0  NAIROBI WEST       Urban         0  10126  ...  20242  Nairobi  NAIROBI        0
1  NAIROBI WEST       Urban         1   8124  ...  16113  Nairobi  NAIROBI        1
2  NAIROBI WEST       Urban         2   8462  ...  17089  Nairobi  NAIROBI        2
3  NAIROBI WEST       Urban         3   8334  ...  16754  Nairobi  NAIROBI        3
4  NAIROBI WEST       Urban         4   7948  ...  15768  Nairobi  NAIROBI        4
5  NAIROBI WEST       Urban         5   7547  ...  15207  Nairobi  NAIROBI        5
6  NAIROBI WEST       Urban         6   6966  ...  14048  Nairobi  NAIROBI        6
7  NAIROBI WEST       Urban         7   6511  ...  13185  Nairobi  NAIROBI        7
8  NAIROBI WEST       Urban         8   6171  ...  12660  Nairobi  NAIROBI        8
9  NAIROBI WEST       Urban         9   6361  ...  13023  Nairobi  NAIROBI        9

[10 rows x 9 columns]

## 1.3 Accessing Information about our Dataset

In [ ]:
# We can getting to know more about the dataset by accessing its information 
#
df.info()
df.loc[df['Age_years'] == '80+', 'Age_years'] = '80'
df.loc[df['Age_years'] == 'Age NS', 'Age_years'] = '0'
df['Age_years'] = pd.to_numeric(df['Age_years'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  int64
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(5), object(4)
memory usage: 1.7+ MB

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# What was the average age of a person of Kenya?
#
df['Age_years'].mean()

39.51219512195122

In [ ]:
# Challenge 2
# What was the average female population in Kenya?
#
df['Female'].mean()

763.8725019669552

In [ ]:
# Challenge 3
# What was the average male population in Kenya?
#
df['Male'].mean()

755.0140833988985

In [ ]:
# Challenge 4
# Which 5 districts were the most densely populated Kenya in descending order?
#
df.groupby('District').sum()['Total'].sort_values(ascending=False).head(5)

               Age_years    Male  Female   Total  OBJECTID
District
BARINGO             6480   79912   82439  162351   2454026
BARINGO NORTH       6480   46228   47561   93789   2467626
BOMET               6480  194862  202242  397104   2857618
BONDO               6480   76468   81054  157522   2023842
BORABU              6480   37079   36347   73426   2279354
...                  ...     ...     ...     ...       ...
WAJIR WEST          6480   96619   75329  171948   1956604
WARENG              6480  131910  129163  261073   2534866
WEST POKOT          6480   89669   91394  181063   2333146
WESTLANDS           3240  124748  122354  247102     23493
YATTA               6480  132444  141075  273519   1781778

[158 rows x 5 columns]

In [ ]:
# Challenge 5
# Which 5 counties were the most densely populated Counties in descending order?
# 
densely = df.groupby('County').sum()['Total'].sort_values(ascending=False).head(5)
densely

County
Nairobi     3138369
Kiambu      1673785
Kakamega    1660651
Nakuru      1603325
Meru        1591533
Name: Total, dtype: int64

In [ ]:
# Challenge 6
# Which 5 districts were the most sparsely populated in descending order?
# 
sparsely = df.groupby('District').sum()['Total'].sort_values(ascending=True).head(5)
sparsely.sort_values(ascending=False)

District
SAMBURU NORTH     59801
SAMBURU EAST      59094
MARSABIT          46502
GARBATULLA        43118
LAIKIPIA NORTH    32762
Name: Total, dtype: int64

In [ ]:
# Challenge 7
# What was the average population of the the most densely populated county in Kenya?
# 
avarage_of_the_most_populated_county = df.groupby('County').mean()['Total'].sort_values(ascending=False).head(1)
avarage_of_the_most_populated_county

County
Nairobi    9568.198171
Name: Total, dtype: float64

In [ ]:
# Challenge 8
# What was the average population of the the most sparsely populated county in Kenya?
# 
avarage_of_the_sparsely_populated_county = df.groupby('County').mean()['Total'].sort_values(ascending=True).head(1)
avarage_of_the_sparsely_populated_county

County
Isiolo    436.871951
Name: Total, dtype: float64

In [ ]:
# Challenge 9
# What was the total population of Busia County? 
# 

df.loc[df['County'] == 'Busia']['Total'].sum()

743946

In [ ]:
# Challenge 10
# What was the average age of person in Busia County? How many people of this age were in Busia County?
# 
df.loc[df['County'] == 'Busia']['Age_years'].mean()

39.51219512195122

In [ ]:
# Challenge 11
# What was the Total population of Teso South District?
# 
df.loc[df['District'] == 'TESO SOUTH']['Total'].sum()

137924

In [90]:
# Challenge 12
# What was the urban population of Teso South District?
# 
df.loc[(df['Urban/Rural'] == 'Urban') & (df['District'] == 'TESO SOUTH')]['Total'].sum()

26162

In [91]:
# Challenge 13
# What was the rural population of Teso South District?
# 
df.loc[(df['Urban/Rural'] == 'Rural') & (df['District'] == 'TESO SOUTH')]['Total'].sum()

111762

In [92]:
# Challenge 14
# What was the population of people aged 60 and above in Kenya?
#
df.loc[df['Age_years'] >= 60]['Total'].sum()

1926051

In [93]:
# Challenge 15 
# What was the urban population in Kenya?
#
df.loc[df['Urban/Rural'] == 'Urban']['Total'].sum()

12487375